{"posts":[{ "title": "Nice Beach fossils shirt - missed connections" , "body": "At the risk of missing a chance with a cute guy wearing my favorite bands shirt, I gotta post this. It was by port authority in the 42 st station and we passed quickly I was wearing a long floral dress :)message back with if you are brunette or blonde, and which I am, and what color dress I was wearing so I know it's you lol one can hope", "location": "newyork", "time": "2018-06-11", "hash":"6d05980fbaf509906f620c4ecfe4504d"},{ "title": "Young Lady I used to talk to in East Liverpool Oh - missed connections" , "body": "I met you in East Liverpool last winter. You were in town with your brother most of the time, your mom lived in town by the college and you said you had a relation in Rogers. I just wonder how you are doing and if you ever get back to Liverpool. I would talk to you at night and you had a nickname that you called me and you knew what I drove. If you happen to see this, let me know. This is not for anything illegal, you were someone nice to talk to. Not likely but hey, you never know.", "location": "pittsburgh", "time": "2018-06-11", "hash":"eb2286bc4a7512e2d2e095dc074c187d"},{ "title": "ups - missed connections" , "body": "you work at UPS in High Point.really nice smile and looks to die for.always have been so nice and friendly to me and a smile.chatted a lot.would love to get to know you more.", "location": "raleigh", "time": "2018-06-11", "hash":"11c44fa01c4ee4228f1faa2ee5467e7d"},{ "title": "Goodwill shopping - missed connections" , "body": "We were both at Goodwill shopping yesterday, your beauty caught my eye. The first thing you picked up was a hat from a lower shelf and tried it on. It looked good on you, and we smiled at each other, you kept bending over next to me and giving me a nice view of your lovely cleavage/breasts. Really wish now that I had said hi or something, if this is you please reach out, you will know the location of the goodwill we were at.", "location": "raleigh", "time": "2018-06-11", "hash":"9771e495cac70bd1dc3af7fd2571d87a"}]}