{"posts":[{ "title": "Someone to kick it with - missed connections" , "body": "Been working down there . I'm from Altoona . Would lime to meet people down here to chill an hang with . Male an female . Couples welcome ;) message me details an we will work them out .", "location": "pittsburgh", "time": "2018-06-11", "hash":"cfe7f0feaba0811a689f1d4d438fe804"},{ "title": "On Subway Line 7 Tonight - missed connections" , "body": "I jumped on the subway at Citi Field after the game, you were already on there when I stepped on. We were both at the front of the car; I was standing infront of people sitting just at the first door, you were at the very front where there wasn't even a seat. You may have been with a friend, it was hard to tell. You were a guy wearing glasses, a backpack, maybe a plain white tee, and looked like you just had a fresh haircut. I am a brunette girl with medium long hair, was wearing my glasses, and a white & grey striped T-shirt. I tried to smile at you but I am not sure if you saw. I got off at 5th Ave to get on the D line, you stayed on the 7 line. I got off and had a moment to look back and thought I saw you looking out at me. I have never posted a missed connection but I have nothing to lose!", "location": "newyork", "time": "2018-06-11", "hash":"f6f6ad701e67e1a0ce3e34308c367c70"},{ "title": "You Told Me You Love Music - missed connections" , "body": "I knew it when I saw your tattoo, so I started a conversation on the subject. I told you I play a couple of instruments, but didn't mention that I love music too. That fact alone could have been the basis for a great friendship, but your being a girl, and me being a stranger guy attempting to 'break the ice,' precipitated the classical statement 'I have a boyfriend, I don't think it would be appropriate.' And I kept wondering all day, why is it that guys can have plenty of girlfriends, but it is not 'appropriate' for women to make new male acquaintances when they have a significant other? This could pass as just another typical situation in which a woman turns down a guy that is trying to 'hit on her,' if it weren't for I was genuinely attempting to relate to another soul on the basis of a mutual passion for music, and I believed that you were truly convinced of what you were telling me. Friendship does not have to involve the sexual element, but somehow we have been programmed to believe that such bond between a woman and a man cannot exist. Prejudice got in the way. This was truly a missed connection.", "location": "raleigh", "time": "2018-06-11", "hash":"59d1fb99f5e2c9997a3c5695a618f7cb"},{ "title": "Thrift Town - missed connections" , "body": "I was working the floor at Thrift Town in Niles on 422 it was Thursday May 3rd you came in and looked at a dryer and then went and looked around the store we spoke about catching Leprechauns when you were a child your name is Darren would like to talk to you some more. In the subject line post what I was catching with my grandson. So to weed out the Bots. Thanks can't wait to hear from you.", "location": "pittsburgh", "time": "2018-06-11", "hash":"104acf9da838d88b5ae3062014edb012"}]}