{"posts":[{ "title": "jason in uniontown area - missed connections" , "body": "id like to reconnect with you ..we had some good times together...if ur still in the area..hmu..we should get together again...miss you.", "location": "pittsburgh", "time": "2018-06-08", "hash":"2d035b8ddf31bd8bb61ae4701c1cff7c"},{ "title": "F train plaform - missed connections" , "body": "I saw you talking to a pretty women on the F train platform waiting for our train about 4:30pm. JUNE 6,You are tall salt and pepper hair, light brown eyes light tan or olive skin tone. maybe Italian or latino, you had on a maroon adidas t shirt and you were carrying a black military style shoulder bag.You look caring and very sexy, I love that in a man. It look like she is very into you, if she doesn't work out, mail me I'd love to have coffee with you", "location": "newyork", "time": "2018-06-08", "hash":"3f8b196dd1e9aafd3745ac6d410b2afd"},{ "title": "Sexy Subaru driver tonight on Prospect park southwest (m4w) - missed connections" , "body": "Loved the cat and mouse game. 10/10 would chase again😉🚴🏾‍♂️💨Find me", "location": "newyork", "time": "2018-06-08", "hash":"e2e64dfae66eb51e71bd5ed9971d9513"},{ "title": "something about the city m4m - missed connections" , "body": "will always love you , on and on. how beautiful you are when you talk about god in those restaurants. you still look like no one else. will always miss you-- still can't bear to walk by the river. xoxo", "location": "newyork", "time": "2018-06-08", "hash":"3a0c2523c965db5e27372d5d3b2800ab"},{ "title": "Bridgeport Farmer's Market, then Sam's Club Sunday 5/27 - missed connections" , "body": "First saw you at the Bridgeport Farmer's Market, then at Sam's Club on Emily Drive.You: Older guy, 70s (?), shirt, shorts, sexy silver hair and mustache. We said hi at Sam's...couldn't keep my eyes off of you. Really wanted to talk with you but wasn't alone. You noticed me as well at Sam's...gave me a sexy smile.Hope you see this as I would rock your world!!!!!!!!!!!", "location": "pittsburgh", "time": "2018-06-08", "hash":"33b6411d2358612d48b4ec058fa0ab0e"},{ "title": "Le Farm Bakery - missed connections" , "body": "I was on my phone, waiting for my coffee. You were chatting with your friend. I noticed you looking at me a few times, and I kept looking back when you did, trying to make eye contact. You looked away every time! If you really are interested, tell me what kind of shirt I was wearing. If you have qwikmeet let me know what name you go by.", "location": "raleigh", "time": "2018-06-08", "hash":"cf285d97a1a00b85c3611196543619b7"},{ "title": "Blue quarterzip on Sunday night flight from IAD to RDU - missed connections" , "body": "I know this is a long shot but you were the blonde guy wearing a blue quarter-zip, carrying a blue Adidas duffel and reading the 4-Hour Work Week. I was the girl sitting across from you at the gate and on the same bus with you to the parking lot wearing red shoes. I think you were looking at me and may have caught me looking back. Hopefully you'll see this.", "location": "raleigh", "time": "2018-06-08", "hash":"f3c570f29ac1442d6b5af6e0cbcd69c8"},{ "title": "Chapel Hill North Trail Runner - 6/5/18 - missed connections" , "body": "We chatted from across Sewell School Road. I started and finished my mountain biking simultaneously with your run.Would love to talk to you again.", "location": "raleigh", "time": "2018-06-08", "hash":"efc1bdb6ee8e2b6cff40e901359652c5"},{ "title": "Cute Indian girl with glasses - missed connections" , "body": "You were the gorgeous Indian (I think) girl sitting with your friend on the E train. You had glasses on and were wearing jeans and a grey top. I was standing close by. I think you noticed me, but I'm not sure. We should grab a coffee or something", "location": "newyork", "time": "2018-06-08", "hash":"a600a7c5648a24b7d63334ceb9b00fe7"}]}