{"posts":[{"body": "young white guy with big lips and blond hair. you had on a gray hoodie and cargo shorts. you were with a older guy. im the guy y'all tried to cut in line. anyway i want my dick sucked. hmu i interested.", "title": "Guy hanging 'Leasing' sign - m4m - missed connections", "hash": "d9d3ee2186943dd926f242ae5a3cb258", "location": "raleigh", "time": "2017-11-02"},{"body": "We used to play regularly before we moved to different apartment in W. Raleigh.  Saw you once since where I work.  You loved getting it from both directions at the same time...we miss playing with you and would love to reconnect.  Hope to hear from you! Available on Thursdays and Fridays each week.  You have a dark beard and are an amazing 3rd!", "title": "Nude beers? - m4m - missed connections", "hash": "83c995585dc5dd68b8eb7fb355ca16b0", "location": "raleigh", "time": "2017-11-02"},{"body": "Trouble all the way up to my neckAnd I can keep it cool and newUntil you catch me half past twoJust about that time and I'm a wreck", "title": "Wal-Mart South Chapel Hill 15/501 - m4m - missed connections", "hash": "e708eb003856927f7e68560a5c14de88", "location": "raleigh", "time": "2017-11-02"},{"body": "Not sure if it's a MC or not but I have received a couple of emails from who I believe is you. I am no longer a paid subscriber to Match as I'm taking a break but if you'd like to talk, send an email. To weed out spam please describe one of my photos.", "title": "The Twisted Fork waiter,  Kevin - m4m - missed connections", "hash": "6ed7a68014e1c8f419e3d3070953c60a", "location": "raleigh", "time": "2017-11-02"},{"body": "Hey, so this may be a stretch and you probably won't see this but that's how this goes right!?About 6:20pm I pulled into the parking lot, parked and started to walk in. I noticed you near your green ford pickup first, then you asked a favor for me to take your cart. I was very happy to as you were very attractive! You gave me a nice smile and maybe even a wink? Wish I had not walked off right away.. Your ford truck also had a Glock sticker, my kind of woman ;)Message back if this is you!", "time": "2017-11-02", "hash": "8be2c2ffdc75dfe26c2f2da5f2bba369", "location": "raleigh", "title": "PF Glenwood - m4m - missed connections"},{"body": "heyif u are reading this, i am likely speaking to you. - hope that you know how wonderful u are - distance exists between us, however - it is natural, organic even . if u find this, u will know it's for u ,if that happens, confront me about it IRL - you are super cool .ttyl", "time": "2017-11-02", "hash": "b82fe8a4b20b406be76fbcbcb89b3447", "location": "newyork", "title": "Missing Tina  (DARIEN) - m4w - missed connections"},{"body": "I asked about your insulin pump, wish you hadn't left so quickly!Too bad our team didn't win, too bad I won't see you at the next bout", "time": "2017-11-02", "hash": "c744f3d9731874a70675d2d34fdbde16", "location": "raleigh", "title": "PRI - m4w - missed connections"},{"body": "Have had a crush on you since I was a teenager. You are one of the sexiest moms, beautiful all the way around. Slim chance you see this or respond if you do, but it's worth a try.", "time": "2017-11-02", "hash": "959c3d484ed6f61452b65b0c852f6780", "location": "raleigh", "title": "Smithfield wal mart - m4m - missed connections"},{"body": "I came up to Raleigh for the day, about an hour's drive, for a conference I had to go to for work. After the conference, we ate with the president of the organization and my coworkers. I thought you were so cute. You remind me a lot of Jimmy Whetzel on youtube. I tried to glance at you and try to send you super obvious hints. You probably noticed, and I did see/feel you bump my arm when you were bringing me more water (or whatever you were doing that moment).Had I not carpooled, I'd probably just sit there and stare at you all night, because I'm just that socially awkward and can't really directly make any interaction without feeling really bad about myself.Anyways, you're cute and made me smile.", "title": "My Cage ~ My Poet - missed connections", "hash": "f56b4daf074bf6be1287a24bf45f9ccc", "location": "raleigh", "time": "2017-11-02"},{"body": "Was at this location last night the place was packed, noticed to guys there last night one was dressed up in a alligator costume  was very friendly, dirty blond hair, very good looking the other one was dressed in a Green Lantern costume was also very hot looking.The 1st would come up and  talk allot very friendly way  was getting a vibe, I know he may have had one to many to be social.  Was a mix of hot guys there last night these where the ones who stood out and seems very friendly.", "title": "Melanie - m4w - missed connections", "hash": "b955dac83340dcee0ba3d8cf8bc204b9", "location": "raleigh", "time": "2017-11-02"},{"body": "My deepest desire is for you to be honest forthright and real with Me I only want to understand you Deeply and Completely No matter how complicated It's what I do best And I choose do to it with you ;)ReallyAnd only You Annnnnnnnd my brain is connected to my pussy and my pussy is connected to my heart I should write a song lol but not at all cause I need to make it clear that I'm not going anywhere but my head& heart need attention too and I know you're more than capable but it you don't want to yeah I don't want too", "title": "2 train - m4m - missed connections", "hash": "e6d7686c11337e49127b1527e28a328c", "location": "newyork", "time": "2017-11-02"},{"body": "Hey troll get a life. You have to be a loser to keep trolling missed connections. I think you missed your connection when you were born.", "title": "Looking for Donna Wilson - w4w - missed connections", "hash": "8d3381e437b4f63aab4d7b30ff8f9995", "location": "pittsburgh", "time": "2017-11-02"},{"body": "Woman with black hair wearing tight fitted jacket that was oppositie me on the train from 14th Street until we both got off at 86th Street.  Interested?", "time": "2017-11-02", "hash": "f87cbd69860aef4c34dade9561a7348b", "location": "newyork", "title": "In Central Park - m4w - missed connections"},{"body": "Very doubtful that you are going to read this,  but I'm taking a chance.  To the absolutely stunning woman that helped me at Habitat about 12 pm on Saturday..Thank you for helping me with the sad panther.  My daughter loves it... would have loved to have chatted more,  but I couldn't ask what I wanted to infront of her...Hopefully I'll hear from you", "time": "2017-11-02", "hash": "04d489d1f0d48846a4561d91b3a969ab", "location": "raleigh", "title": "Lowes food - m4m - missed connections"},{"body": "I was in line while you were checking out. It looked like you were buying batteries. You're cute and I like the shooting star tattoo. I'm guessing you also drive the big, black truck that was leaving when I left the store. If you have qwikmeet or snap tell me the name you go by.", "time": "2017-11-02", "hash": "55bfe63cfb10763f8e99fff33d213601", "location": "pittsburgh", "title": "Zack Fratters - m4m - missed connections"},{"body": "You were seated next to me in the second row. You had an infectious smile and a rad foot tattoo (and told me Rusev would win). I was wearing a glorious shirt and with my awesomely loud friend.", "time": "2017-11-02", "hash": "d9bc6881131e011d952b01603b923275", "location": "raleigh", "title": "Hot Asian girl at Hurricanes game - Tues. Oct. 10th, 2017 - m4w - missed connections"},{ "title": "To the most beautiful woman with the most beautifully flowered name - m4w - missed connections", "body": "Cute girl in blue scrubs.  I see you here and there and it seems like you always look my way.  Maybe there's something there, maybe not.  But I'd love to make a new friend.", "location": "newyork", "time": "2017-11-02", "hash": "bc766a16210038522ef06516d33a4293"},{ "title": "Broken heaRt maIntenANce - w4m - missed connections", "body": "Enter 'I don't usually post to this'. But, you were at my shop today. I felt a good vibe. We some how started talking about UFO's. Tell me what you bought, and the color shirt I was wearing.", "location": "raleigh", "time": "2017-11-02", "hash": "1fdc6b6b472308fa9ca57d5bd9828067"},{ "title": "You sucked my cock in sauna - m4m - missed connections", "body": "You had on blue pants. We spoke briefly outside the court today before you were pulled away,From me. Would love to finish our conversation.", "location": "newyork", "time": "2017-11-02", "hash": "2575d01e0c3bd92b3054211d300993de"},{ "title": "4feet 10' Freckles and red curly hair - m4w - missed connections", "body": "I seen you hard body wish we would have spoken hit me backHardbody Pictures for pictures I might like it better if we train together", "location": "newyork", "time": "2017-11-02", "hash": "9941b7cc0552e94918ccd90ae60268ff"}]}