{"posts":[{ "title": "At the bank today (Johnstown) - missed connections" , "body": "I look for you every time I walk in, and unfortunately, if there's a line, I sometimes lose the chance to see you. Today was different though. I walked in and saw you immediately. My heart raced as our eyes met, and you called me over to your window. You looked absolutely beautiful and my heart raced a little more when I walked up, and saw you closer. Your strawberry blonde hair shined in the light, as we made small talk, and handled business. My head swirled as we interacted, as I tried to figure out a way to stay a little longer. Luckily you presented me with a business opportunity, and I got to hang out for a bit, while we worked things out. I couldn't take my eyes off of you as you had to deal with a slow computer. Your eyes are dazzling, and the room seems much brighter when I walk in and you're there.    In the incredibly small chance that you happen to read this; I have no doubts that you'll know who I am. If you feel the same way, and want to talk, you have my personal number.                                                                                          D", "location": "pittsburgh", "time": "2018-06-14", "hash":"da492f64fdbaf195b79fb5a458003d3e"},{ "title": "Mature lady in black skirt at Habitat off Glenwood - missed connections" , "body": "I was in Habitat for Humanity a few days ago looking around to see what they had and I noticed you. You were wearing a Short black skirt and it was driving me wild! Would love to get in contact!", "location": "raleigh", "time": "2018-06-14", "hash":"635becddf061ced034a5d18617792414"},{ "title": "Martin's general bellwood - missed connections" , "body": "Suzy , I would like to get to know you better . I see you in the mornings early . You always are nice to me and I call you hunny . What do I drive", "location": "pittsburgh", "time": "2018-06-14", "hash":"6334f26b2b17f4e3a0026e9a2e48211e"},{ "title": "Adult store - missed connections" , "body": "We met a Cupid's adult store about a month ago. Had a great time with you. never got to exchange numbers. If your out there get back to me. You were bigger than most. M4m", "location": "newyork", "time": "2018-06-14", "hash":"3d8fa51f10eea401a1e8533459813cb5"}]}