{"posts":[{ "title": "Beautiful Blonde from Hamlet NC - missed connections" , "body": "I saw you at the Kanki on Wakeforest road. You were eating Sushi and talking with he sushi chefs about being a lawyer.  I am so enamored with you.  I am finding myself thinking of you a lot.  We made eye contact once and you smiled and I noticed you have braces but I still think you are beautiful.  I hope you read this and respond.", "location": "raleigh", "time": "2018-06-10", "hash":"767aa49cedc3bdea62e2b8191de19800"},{ "title": "Beautiful woman.Our kids went to the same pre-school in cary. - missed connections" , "body": "This is a long shop but  our kids went to the same pre-school in cary. Everyday I saw you and smiled and wish I would have said more. I was the guy in the big truck. Hopefully you will see this.", "location": "raleigh", "time": "2018-06-10", "hash":"1a46db06e2b432125ed97aa96547f2f2"},{ "title": "Looking for someone - missed connections" , "body": "Looking for a older man named pat I meat up with last year sometime. He lives beside the Wendy's on the boulevard. You probably won't remember Me, but if you see this, or if anyone has is email or private number please respond to ad. Thank you!", "location": "pittsburgh", "time": "2018-06-10", "hash":"d291d94c76feb0a2e844f686a152ba3d"},{ "title": "Downtown A train, Friday morning. m4m - missed connections" , "body": "You: tall Latin guy sat directly across from me on the A train around 9:30 this morning (Friday June 8.) Late 20s?, great hair, glasses, blue shirt, black pants, light brown suede shoes. I think you hopped on at 168 or 145, we both got off at Columbus Circle. Seeing this?", "location": "newyork", "time": "2018-06-10", "hash":"1f82e19abc26823602c457d1ce6bc219"},{ "title": "Purpled pants female - missed connections" , "body": "I'm the older guy in the suit with whom you shared a commute this morning. Let's get to know each other.", "location": "newyork", "time": "2018-06-10", "hash":"aaf8ee30f663059172dbcc8edb8913e4"},{ "title": "Let me Lay My Head In your Lap - missed connections" , "body": "Destinys always around (let me rest my head in your lap)You miss me Same place same time Email me back baby Im waiting N.Westchester Area", "location": "newyork", "time": "2018-06-10", "hash":"5d532b5cb6f01e0ebffa5a878cf4fd3a"},{ "title": "Boxcar Tournament Incomplete - B&B - missed connections" , "body": "My name is B. Your name is B. We met last Sunday, May 20th, at Boxcar. I believe you were with two friends.I walked up to you before my buddies and I left to give you the remaining cup of tokens I had. We then started talking and somehow started a tournament after some minor shit-talking. The first game, which was your choice, was Guitar Hero on Expert. You decimated me. I also now know what Carpal Tunnel Syndrome is. The next game was my choice - Air Hockey. Best of 3, I swept you in the first two rounds. The 3rd and final game for the tie-breaker was _____. You then took a phone call and, after about 10 minutes of waiting, I decided to leave and meet up with my friends. What was that game we were supposed to play for the tiebreaker, so I know it's you? Or mention anything else we discussed.I hope you find this. ;)", "location": "raleigh", "time": "2018-06-10", "hash":"6740735e3806b3668f011e7da0286eae"},{ "title": "California Pizza Kitchen Southpoint - missed connections" , "body": "You were ordering at the take out counter. I was behind you in line and then I sat next to you. I don't know if you were noticing me, but if you were I just want you to know I was noticing you too.", "location": "raleigh", "time": "2018-06-10", "hash":"e512a67cbd46aab65b38e3b3ace2a3e0"},{ "title": "Lowe&#39;s - missed connections" , "body": "You bumped into me with your cart in electrical. Our eyes locked, and both said sorry. As we passed we both turned and looked at each other then disappeared around the corner. Would like to see what that smile was all about.", "location": "pittsburgh", "time": "2018-06-10", "hash":"08c35474c1898bbf02f880ec02235b22"}]}